##todo: Самостоятельная работа

# Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения с остатком.

# x = 10
# print(x)

num1 = int(input())
num2 = int(input())
print(num1 + num2, num1 - num2, num1 / num2, num1 * num2, num1 // num2, num1 % num2, num1 ** num2)